app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "English"], ["room_number", 404]]
---
  def create
    @school_class = SchoolClass.create(school_class_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Art"], ["room_number", 201], ["id", 1]]
---
  def update
    get_school_class.update(school_class_params)