app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-25 22:29:25.486684"], ["id", 1]]
---
  def update
    get_student.update(student_params)